<!-- tf-comment-plan: base -->
### tf plan output: base
```
  + create
      + id   = (known after apply)
      + json = (known after apply)
      + statement {
          + actions   = [
              + "kinesis:PutRecord",
          + resources = [
              + (known after apply),
      + statement {
          + actions   = [
              + "iam:PassRole",
          + resources = [
              + (known after apply),
      + statement {
          + actions   = [
              + "kms:*",
          + resources = [
              + "arn:aws:kms:eu-west-1:135132174985:key/4d500227-47a2-4d56-b715-2ca4f71a1949",
  + resource "aws_iam_role" "cwl_to_kinesis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "logs.eu-west-1.amazonaws.com",
                              + "logs.ap-southeast-1.amazonaws.com",
                      + Sid       = ""
              + Version   = "2012-10-17"
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "base-logs-cloudwatch-cwl-to-kinesis"
      + path                  = "/"
      + unique_id             = (known after apply)
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
  + resource "aws_kinesis_stream" "main" {
      + arn                       = (known after apply)
      + encryption_type           = "KMS"
      + enforce_consumer_deletion = false
      + id                        = (known after apply)
      + kms_key_id                = "alias/base/kinesis"
      + name                      = "base-logs-cloudwatch"
      + retention_period          = 48
      + shard_count               = 2
      + shard_level_metrics       = [
          + "IncomingBytes",
          + "OutgoingBytes",
      + tags                      = {
          + "App"         = "logs-cloudwatch"
          + "Environment" = "base"
```
